tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "thezoraiz/ascii-image-converter"
tap "eddieantonio/eddieantonio"
tap "mongodb/brew"
tap "idleberg/dbxcli"
tap "sdkman/tap"
tap "aws/tap"

brew "zsh"
brew "fzf"
brew "z"
brew "tldr"
brew "howdoi"
brew "docker"
brew "mongosh"
brew "awscli"
brew "sd"
brew "nano"
brew "httpie"
brew "jq"
brew "yq"
brew "yj"
brew "gron" #json to discrete form
brew "pngpaste" #save images from clipboard
brew "pyenv"
brew "ripgrep"
brew "tree"
brew "translate-shell"
brew "eddieantonio/eddieantonio/imgcat"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "qrencode"
brew "qrcp" #send files through qr codes
brew "btop" #process manager
brew "shellcheck"
brew "awscli"
brew "aws-sam-cli"
brew "miller" #text data processor
brew "libpq"
brew "qpdf"
brew "dbxcli"
brew "tesseract" #ocr reader
brew "tesseract-lang" #language pack to ocr
brew "imagemagick" #image processor
brew "diff-so-fancy"
brew "sdkman-cli"

cask "iterm2"
cask "clipy"
cask "rectangle"
cask "keepassxc"
cask "visual-studio-code"
cask "font-hack"
cask "lunar"

